Revit 2024 API
HasNoValueFilterRule Constructor
 constructs an instance of HasNoValueFilterRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public HasNoValueFilterRule(
	ElementId parameter
)
Visual Basic
Public Sub New ( _
	parameter As ElementId _
)
Visual C++
public:
HasNoValueFilterRule(
	ElementId^ parameter
)
Parameters
parameter
Type: Autodesk.Revit.DB.ElementId
 The parameter that an element must not have a value for to pass this rule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
HasNoValueFilterRule Class
Autodesk.Revit.DB Namespace